mongoose-os-libs/bt-common/src/esp32xx/esp32xx_bt_gatts.c
/*
 * Copyright (c) 2014-2018 Cesanta Software Limited
 * All rights reserved
 *
 * Licensed under the Apache License, Version 2.0 (the ""License"");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *     http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an ""AS IS"" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 */

#include "mgos_bt_gatts.h"

#include <stdbool.h>
#include <stdio.h>
#include <stdlib.h>

#include "mgos.h"

#include "host/ble_gap.h"
#include "host/ble_gatt.h"
#include "host/ble_hs.h"

#include "esp32xx_bt_gap.h"
#include "esp32xx_bt_internal.h"

#ifndef MGOS_BT_GATTS_MAX_PREPARED_WRITE_LEN
#define MGOS_BT_GATTS_MAX_PREPARED_WRITE_LEN 4096
#endif

struct esp32xx_bt_service_attr_info;

struct esp32xx_bt_gatts_service_entry {
  struct mgos_bt_uuid uuid;
  uint16_t svc_handle;
  struct esp32xx_bt_service_attr_info *attrs;
  uint16_t num_attrs;
  enum mgos_bt_gatt_sec_level sec_level;
  uint8_t deleting : 1;
  mgos_bt_gatts_ev_handler_t handler;
  void *handler_arg;
  // NimBLE variants of UUID, characteristic and descriptor definitions.
  ble_uuid_any_t ble_uuid;
  struct ble_gatt_chr_def *ble_chars;
  struct ble_gatt_dsc_def *ble_descrs;
  struct ble_gatt_svc_def ble_svc_def[2];
  SLIST_ENTRY(esp32xx_bt_gatts_service_entry) next;
};

struct esp32xx_bt_service_attr_info {
  struct mgos_bt_gatts_char_def def;
  ble_uuid_any_t ble_uuid;
  uint16_t handle;
};

struct esp32xx_bt_gatts_pending_ind {
  uint16_t handle;
  bool is_ind;
  struct mg_str value;
  STAILQ_ENTRY(esp32xx_bt_gatts_pending_ind) next;
};

struct esp32xx_bt_gatts_pending_read {
  uint16_t handle;
  struct mbuf data;
  size_t read_offset;
  SLIST_ENTRY(esp32xx_bt_gatts_pending_read) next;
};

struct esp32xx_bt_gatts_connection_entry;

// A set of sessions is kept for each connection, one per service.
struct esp32xx_bt_gatts_session_entry {
  struct esp32xx_bt_gatts_connection_entry *ce;
  struct mgos_bt_gatts_conn gsc;
  struct esp32xx_bt_gatts_service_entry *se;
  SLIST_ENTRY(esp32xx_bt_gatts_session_entry) next;
};

// This notification mode change is awaiting completion of the security
// procedure.
struct esp32xx_bt_gatts_pending_nm {
  struct mgos_bt_gatts_notify_mode_arg nmarg;
  SLIST_ENTRY(esp32xx_bt_gatts_pending_nm) next;
};

struct esp32xx_bt_gatts_connection_entry {
  struct mgos_bt_gatt_conn gc;
  enum mgos_bt_gatt_sec_level sec_level;
  bool sec_in_flight;
  /* Notifications/indications are finicky, so we keep at most one in flight. */
  int ind_queue_len;
  bool ind_in_flight;
  SLIST_HEAD(sessions, esp32xx_bt_gatts_session_entry)
  sessions;  // 1 per service
  SLIST_HEAD(pending_nm, esp32xx_bt_gatts_pending_nm) pending_nm;
  SLIST_HEAD(pending_reads, esp32xx_bt_gatts_pending_read) pending_reads;
  STAILQ_HEAD(pending_inds, esp32xx_bt_gatts_pending_ind) pending_inds;
  SLIST_ENTRY(esp32xx_bt_gatts_connection_entry) next;
};

static SLIST_HEAD(s_svcs, esp32xx_bt_gatts_service_entry) s_svcs =
    SLIST_HEAD_INITIALIZER(s_svcs);
static SLIST_HEAD(s_conns, esp32xx_bt_gatts_connection_entry) s_conns =
    SLIST_HEAD_INITIALIZER(s_conns);

static void esp32xx_bt_gatts_send_next_ind_locked(
    struct esp32xx_bt_gatts_connection_entry *ce);
static void esp32xx_bt_gatts_create_sessions(
    struct esp32xx_bt_gatts_connection_entry *ce);

static void esp32xx_bt_gatts_pending_ind_free(
    struct esp32xx_bt_gatts_pending_ind *pi) {
  mg_strfree(&pi->value);
  memset(pi, 0, sizeof(*pi));
  free(pi);
}

static void esp32xx_bt_gatts_pending_read_free(
    struct esp32xx_bt_gatts_pending_read *pr) {
  mbuf_free(&pr->data);
  free(pr);
}

static uint16_t get_read_perm(enum mgos_bt_gatt_sec_level sec_level) {
  if (mgos_sys_config_get_bt_gatts_min_sec_level() > sec_level) {
    sec_level = mgos_sys_config_get_bt_gatts_min_sec_level();
  }
  uint16_t res = BLE_GATT_CHR_F_READ;
  switch (sec_level) {
    case MGOS_BT_GATT_SEC_LEVEL_NONE:
      break;
    case MGOS_BT_GATT_SEC_LEVEL_AUTH:
      res |= BLE_GATT_CHR_F_READ_AUTHEN;
      break;
    case MGOS_BT_GATT_SEC_LEVEL_ENCR:
    case MGOS_BT_GATT_SEC_LEVEL_ENCR_MITM:
      res |= BLE_GATT_CHR_F_READ_ENC;
      break;
  }
  return res;
}

static uint16_t get_write_perm(enum mgos_bt_gatt_sec_level sec_level) {
  if (mgos_sys_config_get_bt_gatts_min_sec_level() > sec_level) {
    sec_level = mgos_sys_config_get_bt_gatts_min_sec_level();
  }
  uint16_t res = BLE_GATT_CHR_F_WRITE;
  switch (sec_level) {
    case MGOS_BT_GATT_SEC_LEVEL_NONE:
      break;
    case MGOS_BT_GATT_SEC_LEVEL_AUTH:
      res |= BLE_GATT_CHR_F_WRITE_AUTHEN;
      break;
    case MGOS_BT_GATT_SEC_LEVEL_ENCR:
    case MGOS_BT_GATT_SEC_LEVEL_ENCR_MITM:
      res |= BLE_GATT_CHR_F_WRITE_ENC;
      break;
  }
  return res;
}

static void esp32_gatts_register_cb(struct ble_gatt_register_ctxt *ctxt,
                                    void *arg) {
  char buf[MGOS_BT_UUID_STR_LEN];

  switch (ctxt->op) {
    case BLE_GATT_REGISTER_OP_SVC: {
      LOG(LL_DEBUG, ("REGISTER_SVC %s sh %d",
                     esp32xx_bt_uuid_to_str(ctxt->svc.svc_def->uuid, buf),
                     ctxt->svc.handle));
      break;
    }
    case BLE_GATT_REGISTER_OP_CHR: {
      LOG(LL_DEBUG, ("REGISTER_CHR %s dh %d vh %d",
                     esp32xx_bt_uuid_to_str(ctxt->chr.chr_def->uuid, buf),
                     ctxt->chr.def_handle, ctxt->chr.val_handle));
      break;
    }
    case BLE_GATT_REGISTER_OP_DSC: {
      LOG(LL_DEBUG, ("REGISTER_DSC %s vh %d",
                     esp32xx_bt_uuid_to_str(ctxt->dsc.dsc_def->uuid, buf),
                     ctxt->dsc.handle));
      // Find the attr_info corresponding to this descriptor.
      // Descriptor's arg points at the characteristic and the descriptor
      // must be located after it.
      struct mgos_bt_uuid desc_uuid;
      esp32xx_bt_uuid_to_mgos(ctxt->dsc.dsc_def->uuid, &desc_uuid);
      struct esp32xx_bt_service_attr_info *ai = ctxt->dsc.dsc_def->arg;
      for (ai++; ai->def.is_desc; ai++) {
        if (!mgos_bt_uuid_eq(&ai->def.uuid_bin, &desc_uuid)) continue;
        ai->handle = ctxt->dsc.handle;
        break;
      }
      break;
    }
  }
  (void) arg;
}

static struct esp32xx_bt_gatts_service_entry *find_service_by_attr_handle(
    uint16_t attr_handle, struct esp32xx_bt_service_attr_info **aip) {
  struct esp32xx_bt_gatts_service_entry *se;
  SLIST_FOREACH(se, &s_svcs, next) {
    struct esp32xx_bt_service_attr_info *ai = &se->attrs[0];
    for (size_t i = 0; i < se->num_attrs; i++, ai++) {
      if (ai->handle != attr_handle) continue;
      if (aip != NULL) *aip = ai;
      return se;
    }
  }
  return NULL;
}

static struct esp32xx_bt_gatts_connection_entry *find_connection(
    uint16_t conn_id) {
  struct esp32xx_bt_gatts_connection_entry *ce = NULL;
  SLIST_FOREACH(ce, &s_conns, next) {
    if (ce->gc.conn_id == conn_id) return ce;
  }
  return NULL;
}

static struct esp32xx_bt_gatts_session_entry *find_session(
    uint16_t conn_id, uint16_t handle,
    struct esp32xx_bt_service_attr_info **ai) {
  struct esp32xx_bt_gatts_connection_entry *ce = find_connection(conn_id);
  if (ce == NULL) return NULL;
  struct esp32xx_bt_gatts_service_entry *se =
      find_service_by_attr_handle(handle, ai);
  if (se == NULL) return NULL;
  struct esp32xx_bt_gatts_session_entry *sse;
  SLIST_FOREACH(sse, &ce->sessions, next) {
    if (sse->se == se) return sse;
  }
  return NULL;
}

static struct esp32xx_bt_gatts_session_entry *find_session_by_gsc(
    const struct mgos_bt_gatts_conn *gsc) {
  if (gsc == NULL) return NULL;
  struct esp32xx_bt_gatts_connection_entry *ce =
      find_connection(gsc->gc.conn_id);
  if (ce == NULL) return NULL;
  struct esp32xx_bt_gatts_session_entry *sse;
  SLIST_FOREACH(sse, &ce->sessions, next) {
    if (&sse->gsc == gsc) return sse;
  }
  return NULL;
}

