mongoose-os-libs/bt-common/src/esp32xx/esp32xx_bt_gatts.c
static enum mgos_bt_gatt_status esp32xx_bt_gatts_call_handler(
    struct esp32xx_bt_gatts_session_entry *sse,
    struct esp32xx_bt_service_attr_info *ai, enum mgos_bt_gatts_ev ev,
    void *ev_arg) {
  struct esp32xx_bt_gatts_service_entry *se = sse->se;
  /* Invoke attr handler if defined, fall back to service-wide handler. */
  if (ai != NULL && ai->def.handler != NULL) {
    return ai->def.handler(&sse->gsc, ev, ev_arg, ai->def.handler_arg);
  }
  return se->handler(&sse->gsc, ev, ev_arg, se->handler_arg);
}

void esp32xx_bt_gatts_close_session(
    struct esp32xx_bt_gatts_session_entry *sse) {
  struct esp32xx_bt_gatts_pending_nm *pnm, *pnmt;
  SLIST_FOREACH_SAFE(pnm, &sse->ce->pending_nm, next, pnmt) {
    memset(pnm, 0, sizeof(*pnm));
    free(pnm);
  }
  SLIST_REMOVE(&sse->ce->sessions, sse, esp32xx_bt_gatts_session_entry, next);
  esp32xx_bt_gatts_call_handler(sse, NULL, MGOS_BT_GATTS_EV_DISCONNECT, NULL);
  memset(sse, 0, sizeof(*sse));
  free(sse);
}

static void esp32xx_bt_gatts_create_sessions(
    struct esp32xx_bt_gatts_connection_entry *ce) {
  /* Create a session for each of the currently registered services. */
  struct esp32xx_bt_gatts_service_entry *se;
  SLIST_FOREACH(se, &s_svcs, next) {
    struct esp32xx_bt_gatts_session_entry *sse = calloc(1, sizeof(*sse));
    if (sse == NULL) break;
    sse->ce = ce;
    sse->se = se;
    sse->gsc.gc = ce->gc;
    sse->gsc.svc_uuid = se->uuid;
    enum mgos_bt_gatt_status st = esp32xx_bt_gatts_call_handler(
        sse, NULL, MGOS_BT_GATTS_EV_CONNECT, NULL);
    if (st != MGOS_BT_GATT_STATUS_OK) {
      /* Service rejected the connection, do not create session for it. */
      free(sse);
      continue;
    }
    SLIST_INSERT_HEAD(&ce->sessions, sse, next);
  }
}

int mgos_bt_gatts_get_num_connections(void) {
  int num = 0;
  esp32xx_bt_rlock();
  struct esp32xx_bt_gatts_connection_entry *ce;
  SLIST_FOREACH(ce, &s_conns, next) num++;
  esp32xx_bt_runlock();
  return num;
}

bool mgos_bt_gatts_is_send_queue_empty(void) {
  bool res = true;
  esp32xx_bt_rlock();
  struct esp32xx_bt_gatts_connection_entry *ce;
  SLIST_FOREACH(ce, &s_conns, next) {
    if (!STAILQ_EMPTY(&ce->pending_inds)) {
      res = false;
      break;
    }
  }
  esp32xx_bt_runlock();
  return res;
}

static void esp32xx_bt_gatts_send_next_ind_locked(
    struct esp32xx_bt_gatts_connection_entry *ce) {
  int rc;
  if (ce->ind_in_flight) return;
  if (STAILQ_EMPTY(&ce->pending_inds)) return;
  struct esp32xx_bt_gatts_pending_ind *pi = STAILQ_FIRST(&ce->pending_inds);
  struct os_mbuf *om = ble_hs_mbuf_from_flat(pi->value.p, pi->value.len);
  ce->ind_in_flight = true;
  if (pi->is_ind) {
    rc = ble_gattc_indicate_custom(ce->gc.conn_id, pi->handle, om);
  } else {
    rc = ble_gattc_notify_custom(ce->gc.conn_id, pi->handle, om);
  }
  if (rc != 0) {
    ce->ind_in_flight = false;
    os_mbuf_free(om);
  }
}

static int esp32xx_bt_gatts_mtu_event(uint16_t conn_id,
                                      const struct ble_gatt_error *err,
                                      uint16_t mtu, void *arg) {
  struct esp32xx_bt_gatts_connection_entry *ce = arg;
  LOG(LL_DEBUG, ("MTU_FN %d st %d mtu %d", conn_id, err->status, mtu));
  // Peer may not support MTU exchange procedure, proceed anyway.
  if (err->status == 0) {
    ce->gc.mtu = mtu;
  }
  esp32xx_bt_gatts_create_sessions(ce);
  return 0;
}

int esp32xx_bt_gatts_event(const struct ble_gap_event *ev, void *arg) {
  int ret = 0;
  char buf1[MGOS_BT_UUID_STR_LEN], buf2[MGOS_BT_UUID_STR_LEN];
  LOG(LL_DEBUG,
      ("GATTS EV %d hf %d", ev->type, (int) mgos_get_free_heap_size()));
  esp32xx_bt_rlock();
  switch (ev->type) {
    case BLE_GAP_EVENT_CONNECT: {
      uint16_t conn_id = ev->connect.conn_handle;
      struct ble_gap_conn_desc cd;
      ble_gap_conn_find(conn_id, &cd);
      LOG(LL_INFO,
          ("CONNECT %s ch %d st %d AM %d M %d",
           esp32xx_bt_addr_to_str(&cd.peer_ota_addr, buf1), conn_id,
           ev->connect.status, ble_att_preferred_mtu(), ble_att_mtu(conn_id)));
      if (ev->connect.status != 0) break;
      struct esp32xx_bt_gatts_connection_entry *ce = calloc(1, sizeof(*ce));
      if (ce == NULL) {
        ble_gap_terminate(conn_id, BLE_ERR_REM_USER_CONN_TERM);
        break;
      }
      ce->gc.conn_id = conn_id;
      ce->gc.mtu = ble_att_mtu(conn_id);
      esp32xx_bt_addr_to_mgos(&cd.peer_ota_addr, &ce->gc.addr);
      SLIST_INIT(&ce->pending_nm);
      STAILQ_INIT(&ce->pending_inds);
      SLIST_INSERT_HEAD(&s_conns, ce, next);
      ble_gattc_exchange_mtu(conn_id, esp32xx_bt_gatts_mtu_event, ce);
      break;
    }
    case BLE_GAP_EVENT_DISCONNECT: {
      const struct ble_gap_conn_desc *cd = &ev->disconnect.conn;
      uint16_t conn_id = cd->conn_handle;
      LOG(LL_INFO, ("DISCONNECT %s ch %d reason %d",
                    esp32xx_bt_addr_to_str(&cd->peer_ota_addr, buf1), conn_id,
                    ev->disconnect.reason));
      struct esp32xx_bt_gatts_connection_entry *ce = find_connection(conn_id);
      if (ce == NULL) break;
      SLIST_REMOVE(&s_conns, ce, esp32xx_bt_gatts_connection_entry, next);
      while (!SLIST_EMPTY(&ce->sessions)) {
        struct esp32xx_bt_gatts_session_entry *sse = SLIST_FIRST(&ce->sessions);
        esp32xx_bt_gatts_close_session(sse);
      }
      struct esp32xx_bt_gatts_pending_ind *pi, *pit;
      STAILQ_FOREACH_SAFE(pi, &ce->pending_inds, next, pit) {
        esp32xx_bt_gatts_pending_ind_free(pi);
      }
      struct esp32xx_bt_gatts_pending_read *pr, *prt;
      SLIST_FOREACH_SAFE(pr, &ce->pending_reads, next, prt) {
        esp32xx_bt_gatts_pending_read_free(pr);
      }
      free(ce);
      break;
    }
    case BLE_GAP_EVENT_ENC_CHANGE: {
      uint16_t ch = ev->enc_change.conn_handle;
      struct ble_gap_conn_desc cd = {0};
      ble_gap_conn_find(ch, &cd);
      struct ble_gap_sec_state *ss = &cd.sec_state;
      struct esp32xx_bt_gatts_connection_entry *ce = find_connection(ch);
      if (ce == NULL) break;
      ce->sec_in_flight = false;
      LOG(LL_DEBUG, ("ENC_CHANGE %s ch %d st %d e %d a %d b %d ks %d",
                     esp32xx_bt_addr_to_str(&cd.peer_ota_addr, buf1), ch,
                     ev->enc_change.status, ss->encrypted, ss->authenticated,
                     ss->bonded, ss->key_size));
      if (ev->enc_change.status != 0) {
        ble_gap_terminate(ch, BLE_ERR_REM_USER_CONN_TERM);
        break;
      }
      while (!SLIST_EMPTY(&ce->pending_nm)) {
        struct esp32xx_bt_gatts_pending_nm *pnm = SLIST_FIRST(&ce->pending_nm);
        SLIST_REMOVE_HEAD(&ce->pending_nm, next);
        struct mgos_bt_gatts_notify_mode_arg *narg = &pnm->nmarg;
        uint16_t ah = narg->handle;
        struct esp32xx_bt_service_attr_info *ai = NULL;
        struct esp32xx_bt_gatts_session_entry *sse = find_session(ch, ah, &ai);
        LOG(LL_DEBUG,
            ("NOTIFY_MODE ch %d ah %d %s/%s %d", ch, ah,
             mgos_bt_uuid_to_str(&narg->svc_uuid, buf1),
             mgos_bt_uuid_to_str(&narg->char_uuid, buf2), narg->mode));
        esp32xx_bt_gatts_call_handler(sse, ai, MGOS_BT_GATTS_EV_NOTIFY_MODE,
                                      narg);
        memset(pnm, 0, sizeof(*pnm));
        free(pnm);
      }
      break;
    }
    case BLE_GAP_EVENT_MTU: {
      // Note: this event is not delivered in case of MTU exchange error,
      // and in case of success it duplicates esp32xx_bt_gatts_mtu_event.
      break;
    }
    case BLE_GAP_EVENT_SUBSCRIBE: {
      uint16_t ch = ev->subscribe.conn_handle;
      uint16_t ah = ev->subscribe.attr_handle;
      struct esp32xx_bt_service_attr_info *ai = NULL;
      struct esp32xx_bt_gatts_session_entry *sse = find_session(ch, ah, &ai);
      if (sse == NULL) break;
      struct mgos_bt_gatts_notify_mode_arg narg = {
          .svc_uuid = sse->se->uuid,
          .char_uuid = ai->def.uuid_bin,
          .handle = ev->subscribe.attr_handle,
          .mode = MGOS_BT_GATT_NOTIFY_MODE_OFF,
      };
      if (ev->subscribe.cur_notify) {
        narg.mode = MGOS_BT_GATT_NOTIFY_MODE_NOTIFY;
      } else if (ev->subscribe.cur_indicate) {
        narg.mode = MGOS_BT_GATT_NOTIFY_MODE_INDICATE;
      }
      // Work around https://github.com/apache/mynewt-nimble/issues/1092
      if (sse->se->sec_level > 0 ||
          mgos_sys_config_get_bt_gatts_min_sec_level() > 0) {
        struct ble_gap_conn_desc cd = {0};
        ble_gap_conn_find(ch, &cd);
        struct ble_gap_sec_state *ss = &cd.sec_state;
        if (!ss->encrypted) {
          struct esp32xx_bt_gatts_pending_nm *pnm = calloc(1, sizeof(*pnm));
          pnm->nmarg = narg;
          SLIST_INSERT_HEAD(&sse->ce->pending_nm, pnm, next);
          if (!sse->ce->sec_in_flight) {
            sse->ce->sec_in_flight = true;
            ble_gap_security_initiate(ch);
          }
          ret = BLE_ATT_ERR_INSUFFICIENT_AUTHOR;
          break;
        }
      }
      LOG(LL_DEBUG, ("NOTIFY_MODE ch %d ah %d %s/%s %d", ch, ah,
                     mgos_bt_uuid_to_str(&narg.svc_uuid, buf1),
                     mgos_bt_uuid_to_str(&narg.char_uuid, buf2), narg.mode));
      esp32xx_bt_gatts_call_handler(sse, ai, MGOS_BT_GATTS_EV_NOTIFY_MODE,
                                    &narg);
      break;
    }
    case BLE_GAP_EVENT_NOTIFY_TX: {
      uint16_t ch = ev->notify_tx.conn_handle;
      uint16_t ah = ev->notify_tx.attr_handle;
      struct esp32xx_bt_service_attr_info *ai = NULL;
      struct esp32xx_bt_gatts_session_entry *sse = find_session(ch, ah, &ai);
      if (sse == NULL) break;
      struct esp32xx_bt_gatts_connection_entry *ce = sse->ce;
      ce->ind_in_flight = false;
      LOG(LL_DEBUG,
          ("NOTIFY_TX ch %d ah %d st %d", ch, ah, ev->notify_tx.status));
      if (STAILQ_EMPTY(&ce->pending_inds)) break;  // Shouldn't happen.
      bool remove = false;
      struct esp32xx_bt_gatts_pending_ind *pi = STAILQ_FIRST(&ce->pending_inds);
      if (pi->is_ind) {
        // Indication raises this event twice: first with status 0 when
        // indication is sent, then again when it is acknowledged or times out.
        if (ev->notify_tx.status == 0) break;
        remove = (ev->notify_tx.status == BLE_HS_EDONE);
        struct mgos_bt_gatts_ind_confirm_arg ic_arg = {
            .handle = pi->handle,
            .ok = remove,
        };
        esp32xx_bt_gatts_call_handler(sse, ai, MGOS_BT_GATTS_EV_IND_CONFIRM,
                                      &ic_arg);
      } else {
        remove = (ev->notify_tx.status == 0);
      }
      if (remove) {
        STAILQ_REMOVE_HEAD(&ce->pending_inds, next);
        ce->ind_queue_len--;
        esp32xx_bt_gatts_pending_ind_free(pi);
      }
      // Send next one or retry sending this one that failed.
      esp32xx_bt_gatts_send_next_ind_locked(ce);
      break;
    }
  }
  esp32xx_bt_runlock();
  return ret;
}

bool mgos_bt_gatts_disconnect(struct mgos_bt_gatts_conn *gsc) {
  if (gsc == NULL) return false;
  return ble_gap_terminate(gsc->gc.conn_id, BLE_ERR_REM_USER_CONN_TERM) == 0;
}

