mongoose-os-libs/bt-common/src/esp32xx/esp32xx_bt_gatts.c
static int esp32_gatts_get_att_err(enum mgos_bt_gatt_status st) {
  switch (st) {
    case MGOS_BT_GATT_STATUS_OK:
      return 0;
    case MGOS_BT_GATT_STATUS_INVALID_HANDLE:
      return BLE_ATT_ERR_INVALID_HANDLE;
    case MGOS_BT_GATT_STATUS_READ_NOT_PERMITTED:
      return BLE_ATT_ERR_READ_NOT_PERMITTED;
    case MGOS_BT_GATT_STATUS_WRITE_NOT_PERMITTED:
      return BLE_ATT_ERR_WRITE_NOT_PERMITTED;
    case MGOS_BT_GATT_STATUS_INSUF_AUTHENTICATION:
      return BLE_ATT_ERR_INSUFFICIENT_AUTHEN;
    case MGOS_BT_GATT_STATUS_REQUEST_NOT_SUPPORTED:
      return BLE_ATT_ERR_REQ_NOT_SUPPORTED;
    case MGOS_BT_GATT_STATUS_INVALID_OFFSET:
      return BLE_ATT_ERR_INVALID_OFFSET;
    case MGOS_BT_GATT_STATUS_INSUF_AUTHORIZATION:
      return BLE_ATT_ERR_INSUFFICIENT_AUTHOR;
    case MGOS_BT_GATT_STATUS_INVALID_ATT_VAL_LENGTH:
      return BLE_ATT_ERR_INVALID_ATTR_VALUE_LEN;
    case MGOS_BT_GATT_STATUS_UNLIKELY_ERROR:
      return BLE_ATT_ERR_UNLIKELY;
    case MGOS_BT_GATT_STATUS_INSUF_RESOURCES:
      return BLE_ATT_ERR_INSUFFICIENT_RES;
  }
  return BLE_ATT_ERR_UNLIKELY;
}

// Workaround for https://github.com/apache/mynewt-nimble/issues/1090
bool esp32xx_bt_gatts_send_resp_data(struct ble_gatt_access_ctxt *ctxt,
                                     struct esp32xx_bt_gatts_session_entry *sse,
                                     uint16_t ch, uint16_t ah, bool quiet) {
  char buf[MGOS_BT_UUID_STR_LEN];
  struct esp32xx_bt_gatts_pending_read *pr;
  SLIST_FOREACH(pr, &sse->ce->pending_reads, next) {
    if (pr->handle == ah) break;
  }
  if (pr == NULL) {
    return 0;
  }
  size_t rdl = pr->data.len;
  if (!quiet) {
    LOG(LL_DEBUG, ("READ %s ch %d ah %u off %d rdl %d",
                   mgos_bt_addr_to_str(&sse->gsc.gc.addr, 0, buf),
                   sse->gsc.gc.conn_id, ch, (int) pr->read_offset, (int) rdl));
  }
  os_mbuf_append(ctxt->om, pr->data.buf, rdl);
  pr->read_offset += (ble_att_mtu(ch) - 1);
  if (pr->read_offset >= rdl) {
    SLIST_REMOVE(&sse->ce->pending_reads, pr, esp32xx_bt_gatts_pending_read,
                 next);
    esp32xx_bt_gatts_pending_read_free(pr);
  }
  return rdl;
}

static int esp32_gatts_attr_access_cb(uint16_t ch, uint16_t ah,
                                      struct ble_gatt_access_ctxt *ctxt,
                                      void *arg) {
  int res = 0;
  char buf1[MGOS_BT_UUID_STR_LEN], buf2[MGOS_BT_UUID_STR_LEN],
      buf3[MGOS_BT_UUID_STR_LEN];
  struct esp32xx_bt_service_attr_info *ai = NULL;
  struct esp32xx_bt_gatts_session_entry *sse = find_session(ch, ah, &ai);
  if (sse == NULL) return BLE_ATT_ERR_UNLIKELY;
  switch (ctxt->op) {
    case BLE_GATT_ACCESS_OP_READ_CHR:
    case BLE_GATT_ACCESS_OP_READ_DSC: {
      if (esp32xx_bt_gatts_send_resp_data(ctxt, sse, ch, ah, false) > 0) {
        // Still sending previous response.
        break;
      }
      struct mgos_bt_gatts_read_arg rarg = {
          .svc_uuid = sse->se->uuid,
          .handle = ah,
      };
      struct esp32xx_bt_service_attr_info *cai = arg;
      if (ctxt->op == BLE_GATT_ACCESS_OP_READ_CHR) {
        rarg.char_uuid = ai->def.uuid_bin;
      } else {
        rarg.char_uuid = cai->def.uuid_bin;
        rarg.desc_uuid = ai->def.uuid_bin;
      }
      enum mgos_bt_gatt_status st =
          esp32xx_bt_gatts_call_handler(sse, ai, MGOS_BT_GATTS_EV_READ, &rarg);
      res = esp32_gatts_get_att_err(st);
      size_t rdl = 0;
      if (res == 0) {
        rdl = esp32xx_bt_gatts_send_resp_data(ctxt, sse, ch, ah, true);
      }
      if (ctxt->op == BLE_GATT_ACCESS_OP_READ_CHR) {
        LOG(LL_DEBUG,
            ("READ_CHR %s ch %d ah %u (%s) -> %d %d",
             mgos_bt_addr_to_str(&sse->gsc.gc.addr, 0, buf1),
             sse->gsc.gc.conn_id, rarg.handle,
             mgos_bt_uuid_to_str(&rarg.char_uuid, buf2), st, (int) rdl));
      } else {
        LOG(LL_DEBUG,
            ("READ_DSC %s ch %d ah %u/%u (%s/%s) -> %d %d",
             mgos_bt_addr_to_str(&sse->gsc.gc.addr, 0, buf1),
             sse->gsc.gc.conn_id, cai->handle, rarg.handle,
             mgos_bt_uuid_to_str(&rarg.char_uuid, buf2),
             mgos_bt_uuid_to_str(&rarg.desc_uuid, buf3), st, (int) rdl));
      }
      break;
    }
    case BLE_GATT_ACCESS_OP_WRITE_CHR:
    case BLE_GATT_ACCESS_OP_WRITE_DSC: {
      struct mg_str data = esp32xx_bt_mbuf_to_flat(ctxt->om);
      struct mgos_bt_gatts_write_arg warg = {
          .svc_uuid = sse->se->uuid,
          .handle = ah,
          .data = data,
      };
      struct esp32xx_bt_service_attr_info *cai = arg;
      if (ctxt->op == BLE_GATT_ACCESS_OP_WRITE_CHR) {
        warg.char_uuid = ai->def.uuid_bin;
      } else {
        warg.char_uuid = cai->def.uuid_bin;
        warg.desc_uuid = ai->def.uuid_bin;
      }
      enum mgos_bt_gatt_status st =
          esp32xx_bt_gatts_call_handler(sse, ai, MGOS_BT_GATTS_EV_WRITE, &warg);
      if (ctxt->op == BLE_GATT_ACCESS_OP_WRITE_CHR) {
        LOG(LL_DEBUG, ("WRITE_CHR %s ch %d ah %u (%s) len %d -> %d",
                       mgos_bt_addr_to_str(&sse->gsc.gc.addr, 0, buf1),
                       sse->gsc.gc.conn_id, warg.handle,
                       mgos_bt_uuid_to_str(&warg.char_uuid, buf2),
                       (int) warg.data.len, st));
      } else {
        LOG(LL_DEBUG, ("WRITE_DSC %s ch %d ah %u/%u (%s/%s) len %d -> %d",
                       mgos_bt_addr_to_str(&sse->gsc.gc.addr, 0, buf1),
                       sse->gsc.gc.conn_id, cai->handle, warg.handle,
                       mgos_bt_uuid_to_str(&warg.char_uuid, buf2),
                       mgos_bt_uuid_to_str(&warg.desc_uuid, buf3),
                       (int) warg.data.len, st));
      }
      res = esp32_gatts_get_att_err(st);
      mg_strfree(&data);
      break;
    }
  }
  return res;
}

static int esp32xx_bt_register_service(
    struct esp32xx_bt_gatts_service_entry *se) {
  int rc = 0;
  rc = ble_gatts_count_cfg(&se->ble_svc_def[0]);
  if (rc != 0) {
    LOG(LL_ERROR, ("Count failed"));
    return rc;
  }
  rc = ble_gatts_add_svcs(&se->ble_svc_def[0]);
  if (rc != 0) {
    LOG(LL_ERROR, ("Add failed"));
    return rc;
  }
  return rc;
}

