mongoose-os-libs/bt-common/src/esp32xx/esp32xx_bt_gatts.c
static bool esp32xx_bt_register_services(void) {
  char buf[MGOS_BT_UUID_STR_LEN];
  int rc = ble_gatts_reset();
  if (rc != 0) {
    LOG(LL_ERROR, ("ble_gatts_reset() failed: %d", rc));
    return false;
  }
  struct esp32xx_bt_gatts_service_entry *se;
  SLIST_FOREACH(se, &s_svcs, next) {
    rc = esp32xx_bt_register_service(se);
    if (rc != 0) {
      LOG(LL_ERROR, ("Failed to register BT service %s: %d",
                     mgos_bt_uuid_to_str(&se->uuid, buf), rc));
      return false;
    }
  }
  return true;
}

bool mgos_bt_gatts_register_service(const char *svc_uuid,
                                    enum mgos_bt_gatt_sec_level sec_level,
                                    const struct mgos_bt_gatts_char_def *chars,
                                    mgos_bt_gatts_ev_handler_t handler,
                                    void *handler_arg) {
  bool res = false;
  struct esp32xx_bt_gatts_service_entry *se = calloc(1, sizeof(*se));
  if (se == NULL) goto out;
  if (!mgos_bt_uuid_from_str(mg_mk_str(svc_uuid), &se->uuid)) {
    LOG(LL_ERROR, ("%s: Invalid svc UUID", svc_uuid));
    goto out;
  }
  se->handler = handler;
  se->handler_arg = handler_arg;
  se->sec_level = sec_level;
  const struct mgos_bt_gatts_char_def *cd = NULL;
  // Count the number of attrs required.
  int num_chars = 0, num_descrs = 0;
  for (cd = chars; cd->uuid != NULL; cd++) {
    se->num_attrs++;
    if (!cd->is_desc) {
      num_chars++;
    } else if (cd != chars) {
      num_descrs++;
      // Add 1 extra desc entry per characteristic - for end marker.
      if (!(cd - 1)->is_desc) num_descrs++;
    } else {
      // Descriptors must always follow a characteristic definition
      // so a descriptor cannot be the first item in the list.
      goto out;
    }
  }
  if (num_chars == 0) goto out;
  se->attrs = calloc(se->num_attrs, sizeof(*se->attrs));
  if (se->attrs == NULL) goto out;
  se->ble_chars = calloc(num_chars + 1, sizeof(*se->ble_chars));
  if (se->ble_chars == NULL) goto out;
  if (num_descrs > 0) {
    se->ble_descrs = calloc(num_descrs + 1, sizeof(*se->ble_descrs));
    if (se->ble_descrs == NULL) goto out;
  }

  struct esp32xx_bt_service_attr_info *ai = se->attrs, *last_chr = NULL;
  struct ble_gatt_chr_def *bchr = se->ble_chars;
  struct ble_gatt_dsc_def *bdsc = se->ble_descrs;
  for (cd = chars; cd->uuid != NULL; cd++, ai++) {
    ai->def = *cd;
    if (!cd->is_uuid_bin &&
        !mgos_bt_uuid_from_str(mg_mk_str(cd->uuid), &ai->def.uuid_bin)) {
      LOG(LL_ERROR, ("%s: %s: invalid char UUID", svc_uuid, cd->uuid));
      goto out;
    }
    ai->def.is_uuid_bin = true;
    mgos_bt_uuid_to_esp32(&ai->def.uuid_bin, &ai->ble_uuid);
    if (!cd->is_desc) {
      bchr->uuid = &ai->ble_uuid.u;
      bchr->access_cb = esp32_gatts_attr_access_cb;
      bchr->arg = ai;
      bchr->val_handle = &ai->handle;
      uint16_t pp = cd->prop, ff = 0;
      if (pp & MGOS_BT_GATT_PROP_READ) ff |= get_read_perm(se->sec_level);
      if (pp & MGOS_BT_GATT_PROP_WRITE) ff |= get_write_perm(se->sec_level);
      if (pp & MGOS_BT_GATT_PROP_NOTIFY) ff |= BLE_GATT_CHR_F_NOTIFY;
      if (pp & MGOS_BT_GATT_PROP_INDICATE) ff |= BLE_GATT_CHR_F_INDICATE;
      if (pp & MGOS_BT_GATT_PROP_WRITE_NR) ff |= BLE_GATT_CHR_PROP_WRITE_NO_RSP;
      bchr->flags = ff;
      if ((ff & (BLE_GATT_CHR_F_READ_ENC | BLE_GATT_CHR_F_WRITE_ENC)) != 0) {
        bchr->min_key_size = 16;
      }
      bchr++;
      if (cd != chars && (cd - 1)->is_desc) bdsc++;
      last_chr = ai;
    } else {
      bdsc->uuid = &ai->ble_uuid.u;
      bdsc->min_key_size = 0;
      bdsc->access_cb = esp32_gatts_attr_access_cb;
      bdsc->arg = last_chr;
      uint8_t pp = cd->prop, af = 0;
      if (pp & MGOS_BT_GATT_PROP_READ) af |= BLE_ATT_F_READ;
      if (pp & MGOS_BT_GATT_PROP_WRITE) af |= BLE_ATT_F_WRITE;
      bdsc->att_flags = af;
      if (!(cd - 1)->is_desc) (bchr - 1)->descriptors = bdsc;
      bdsc++;
    }
  }

  mgos_bt_uuid_to_esp32(&se->uuid, &se->ble_uuid);
  struct ble_gatt_svc_def *bsvc = &se->ble_svc_def[0];
  bsvc->type = BLE_GATT_SVC_TYPE_PRIMARY;
  bsvc->uuid = &se->ble_uuid.u;
  bsvc->characteristics = se->ble_chars;
  se->ble_svc_def[1].type = BLE_GATT_SVC_TYPE_END;

  esp32xx_bt_rlock();
  SLIST_INSERT_HEAD(&s_svcs, se, next);
  esp32xx_bt_runlock();
  esp32xx_bt_restart();
  res = true;
out:
  if (!res && se != NULL) {
    free(se->attrs);
    free(se->ble_chars);
    free(se->ble_descrs);
    free(se);
  }
  return res;
}

bool mgos_bt_gatts_unregister_service(const char *uuid_str) {
  struct esp32xx_bt_gatts_service_entry *se;
  struct mgos_bt_uuid uuid;
  if (!mgos_bt_uuid_from_str(mg_mk_str(uuid_str), &uuid)) return false;
  SLIST_FOREACH(se, &s_svcs, next) {
    if (mgos_bt_uuid_eq(&se->uuid, &uuid)) break;
  }
  if (se == NULL) return false;
  // Remove from the list immediately in case it's re-registered.
  SLIST_REMOVE(&s_svcs, se, esp32xx_bt_gatts_service_entry, next);
  se->deleting = true;
  // Close the associated sessions;
  struct esp32xx_bt_gatts_connection_entry *ce;
  SLIST_FOREACH(ce, &s_conns, next) {
    struct esp32xx_bt_gatts_session_entry *sse;
    SLIST_FOREACH(sse, &ce->sessions, next) {
      if (sse->se == se) break;
    }
    if (sse == NULL) continue;
    esp32xx_bt_gatts_close_session(sse);
  }
  free(se->attrs);
  free(se);
  // Need to restart the stack for this to take effect.
  esp32xx_bt_restart();
  return true;
}

void mgos_bt_gatts_send_resp_data(struct mgos_bt_gatts_conn *gsc,
                                  struct mgos_bt_gatts_read_arg *ra,
                                  struct mg_str data) {
  if (data.len == 0) return;
  esp32xx_bt_rlock();
  struct esp32xx_bt_gatts_session_entry *sse = find_session_by_gsc(gsc);
  if (sse == NULL) goto out;
  struct esp32xx_bt_gatts_pending_read *pr = NULL;
  SLIST_FOREACH(pr, &sse->ce->pending_reads, next) {
    if (pr->handle == ra->handle) break;
  }
  if (pr == NULL) {
    pr = calloc(1, sizeof(*pr));
    if (pr == NULL) goto out;
    pr->handle = ra->handle;
    mbuf_init(&pr->data, 0);
    SLIST_INSERT_HEAD(&sse->ce->pending_reads, pr, next);
  }
  mbuf_append(&pr->data, data.p, data.len);
out:
  esp32xx_bt_runlock();
}

void mgos_bt_gatts_notify(struct mgos_bt_gatts_conn *gsc,
                          enum mgos_bt_gatt_notify_mode mode, uint16_t handle,
                          struct mg_str data) {
  if (mode == MGOS_BT_GATT_NOTIFY_MODE_OFF) return;
  struct esp32xx_bt_gatts_session_entry *sse = find_session_by_gsc(gsc);
  if (sse == NULL) return;
  struct esp32xx_bt_gatts_pending_ind *pi = calloc(1, sizeof(*pi));
  if (pi == NULL) return;
  pi->handle = handle;
  pi->is_ind = (mode == MGOS_BT_GATT_NOTIFY_MODE_INDICATE);
  pi->value = mg_strdup(data);
  esp32xx_bt_rlock();
  STAILQ_INSERT_TAIL(&sse->ce->pending_inds, pi, next);
  sse->ce->ind_queue_len++;
  esp32xx_bt_gatts_send_next_ind_locked(sse->ce);
  esp32xx_bt_runlock();
}

void mgos_bt_gatts_notify_uuid(struct mgos_bt_gatts_conn *gsc,
                               const struct mgos_bt_uuid *char_uuid,
                               enum mgos_bt_gatt_notify_mode mode,
                               struct mg_str data) {
  struct esp32xx_bt_gatts_session_entry *sse = find_session_by_gsc(gsc);
  if (sse == NULL) return;
  struct esp32xx_bt_gatts_service_entry *se = sse->se;
  for (uint16_t i = 0; i < se->num_attrs; i++) {
    struct esp32xx_bt_service_attr_info *ai = &se->attrs[i];
    if (mgos_bt_uuid_eq(&ai->def.uuid_bin, char_uuid)) {
      mgos_bt_gatts_notify(gsc, mode, ai->handle, data);
      return;
    }
  }
}

bool esp32xx_bt_gatts_start(void) {
  return esp32xx_bt_register_services();
}

bool esp32xx_bt_gatts_init(void) {
  ble_hs_cfg.gatts_register_cb = esp32_gatts_register_cb;
  return true;
}
